Tekla Open API Reference for Tekla Structures 2025
DrawingPluginBase.InputDefinition.ViewId Property
 The view object's identifier.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier ViewId { get; set; }
Public Property ViewId As Identifier
	Get
	Set
Property Value
Type: Identifier
See Also
Reference
DrawingPluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace